{
  "tests": [
    {
      "test_id": 1,
      "name": "Test 1",
      "parts": {
        "1.1": {
          "type": "interview",
          "questions": [
            "What's your favourite animal?",
            "Have you ever had a pet?",
            "What's the most popular animal in your country?"
          ]
        },
        "1.2": {
          "type": "picture_description",
          "images": [
            "https://images.unsplash.com/photo-1516627145497-ae6968895b74?w=400&h=300&fit=crop",
            "https://images.unsplash.com/photo-1450778869180-e77d3c79a37b?w=400&h=300&fit=crop"
          ],
          "questions": [
            "Describe the animals and the environment you see in the first picture.",
            "What kind of relationship between humans and animals is shown in the second picture?",
            "Compare the two pictures and say which way of interacting with animals you prefer and why."
          ]
        },
        "2": {
          "type": "discussion",
          "questions": [
            "What makes a movie a blockbuster?",
            "Are actors and actresses important to movies?",
            "Do you think films with famous actors or actresses are more likely to become successful films?"
          ]
        },
        "3": {
          "type": "debate",
          "topic": "Keeping pets in apartments should be banned",
          "for_points": [
            "Apartments are too small for most pets, which can lead to animal suffering and poor quality of life.",
            "Pets in apartments can cause noise disturbances, allergic reactions, and hygiene issues for neighbours.",
            "Many pet owners in apartments cannot provide adequate exercise and outdoor time for their animals."
          ],
          "against_points": [
            "Pets provide emotional support and companionship, especially for people living alone in apartments.",
            "Many small pets such as cats, hamsters, and fish are perfectly suited to apartment living.",
            "Responsible pet ownership should be encouraged through education rather than outright bans."
          ]
        }
      }
    },
    {
      "test_id": 2,
      "name": "Test 2",
      "parts": {
        "1.1": {
          "type": "interview",
          "questions": [
            "What kind of food did you like when you were young?",
            "What kinds of food do you particularly like?",
            "What kinds of food are most popular in your country?"
          ]
        },
        "1.2": {
          "type": "picture_description",
          "images": [
            "https://images.unsplash.com/photo-1504674900247-0877df9cc836?w=400&h=300&fit=crop",
            "https://images.unsplash.com/photo-1414235077428-338989a2e8c0?w=400&h=300&fit=crop"
          ],
          "questions": [
            "Describe the food and the setting you can see in the first picture.",
            "What kind of dining experience is shown in the second picture?",
            "Compare the two pictures and discuss which type of meal you would enjoy more."
          ]
        },
        "2": {
          "type": "discussion",
          "questions": [
            "On what occasions would adults feel proud of themselves?",
            "What would children do to make their parents proud?",
            "Is it a good idea to reward children for doing homework or housework?"
          ]
        },
        "3": {
          "type": "debate",
          "topic": "Fast food should be banned in schools",
          "for_points": [
            "Fast food is high in calories, sugar, and fat, contributing to childhood obesity and health problems.",
            "Schools should set a healthy example and promote nutritious eating habits among students.",
            "Banning fast food would encourage children to try healthier alternatives and develop better dietary choices."
          ],
          "against_points": [
            "Banning fast food limits personal freedom and the right of students and parents to choose what to eat.",
            "Fast food is affordable and convenient, making it accessible for families with limited budgets.",
            "Education about balanced diets is more effective than bans, which may lead to unhealthy eating outside school."
          ]
        }
      }
    },
    {
      "test_id": 3,
      "name": "Test 3",
      "parts": {
        "1.1": {
          "type": "interview",
          "questions": [
            "Do you remember your dreams when you wake up?",
            "Do you think dreams will affect life?",
            "Do you think dreams have special meanings?"
          ]
        },
        "1.2": {
          "type": "picture_description",
          "images": [
            "https://images.unsplash.com/photo-1523240795612-9a054b0db644?w=400&h=300&fit=crop",
            "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=400&h=300&fit=crop"
          ],
          "questions": [
            "Describe the people and what they are doing in the first picture.",
            "What kind of atmosphere and activity can you see in the second picture?",
            "Compare the two pictures and explain which learning environment you think is more effective."
          ]
        },
        "2": {
          "type": "discussion",
          "questions": [
            "Do young and old people use phones in the same way?",
            "What positive and negative effects do mobile phones have on friendship?",
            "Do you think there should be laws on the use of mobile phones?"
          ]
        },
        "3": {
          "type": "debate",
          "topic": "Mobile phones should be completely banned in schools",
          "for_points": [
            "Mobile phones distract students from learning and reduce their ability to concentrate in class.",
            "Phone bans reduce cyberbullying and social media pressure during school hours.",
            "Without phones, students interact more face-to-face, improving social skills and building stronger friendships."
          ],
          "against_points": [
            "Mobile phones can be valuable educational tools, providing access to learning apps and online resources.",
            "Students need their phones for safety reasons, such as contacting parents in emergencies.",
            "Teaching students responsible phone usage is more beneficial than imposing a complete ban."
          ]
        }
      }
    },
    {
      "test_id": 4,
      "name": "Test 4",
      "parts": {
        "1.1": {
          "type": "interview",
          "questions": [
            "Do you like reading?",
            "What books do you like to read?",
            "What book did you read recently?"
          ]
        },
        "1.2": {
          "type": "picture_description",
          "images": [
            "https://images.unsplash.com/photo-1456513080510-7bf3a84b82f8?w=400&h=300&fit=crop",
            "https://images.unsplash.com/photo-1513475382585-d06e58bcb0e0?w=400&h=300&fit=crop"
          ],
          "questions": [
            "Describe the reading environment shown in the first picture.",
            "What does the second picture tell us about the role of books in everyday life?",
            "Compare the two pictures and discuss which way of reading appeals to you more."
          ]
        },
        "2": {
          "type": "discussion",
          "questions": [
            "What are the advantages and disadvantages of being a famous child?",
            "What can today's children do to become famous?",
            "Do people become famous just because of their talent?"
          ]
        },
        "3": {
          "type": "debate",
          "topic": "Social media makes people more famous than talent does",
          "for_points": [
            "Many social media influencers gain millions of followers without any traditional talent or skill.",
            "Viral content and algorithms can make anyone famous overnight, regardless of their actual abilities.",
            "Social media rewards attention-grabbing behaviour more than genuine talent or hard work."
          ],
          "against_points": [
            "Truly talented individuals use social media as a platform to showcase their skills to a wider audience.",
            "Social media fame is often short-lived, while talent-based fame tends to be more lasting and respected.",
            "Many successful artists, musicians, and creators were discovered through social media because of their genuine talent."
          ]
        }
      }
    },
    {
      "test_id": 5,
      "name": "Test 5",
      "parts": {
        "1.1": {
          "type": "interview",
          "questions": [
            "What kind of gifts are popular in your country?",
            "What's the best gift you have ever received?",
            "What do you give others as gifts?"
          ]
        },
        "1.2": {
          "type": "picture_description",
          "images": [
            "https://images.unsplash.com/photo-1549465220-1a8b9238f067?w=400&h=300&fit=crop",
            "https://images.unsplash.com/photo-1513885535751-8b9238bd345a?w=400&h=300&fit=crop"
          ],
          "questions": [
            "Describe the celebration or gift-giving moment shown in the first picture.",
            "What emotions and interactions can you observe in the second picture?",
            "Compare the two pictures and explain which type of gift-giving tradition you find more meaningful."
          ]
        },
        "2": {
          "type": "discussion",
          "questions": [
            "Why is it difficult for some people to relax?",
            "Which is more important, mental relaxation or physical relaxation?",
            "Do you think there should be classes for training young people and children how to relax?"
          ]
        },
        "3": {
          "type": "debate",
          "topic": "Giving money as a gift is better than giving physical presents",
          "for_points": [
            "Money allows the recipient to buy exactly what they want or need, avoiding unwanted gifts.",
            "It eliminates the stress and time spent on choosing the right present for someone.",
            "Money is practical and can be saved or invested, providing long-term value beyond a single item."
          ],
          "against_points": [
            "Physical gifts show more thought and effort, demonstrating that the giver truly knows the recipient.",
            "Receiving a wrapped present creates excitement and emotional connection that money cannot replicate.",
            "Giving money can feel impersonal and may suggest a lack of care or creativity on the part of the giver."
          ]
        }
      }
    },
    {
      "test_id": 6,
      "name": "Test 6",
      "parts": {
        "1.1": {
          "type": "interview",
          "questions": [
            "Do you walk a lot?",
            "Did you often go outside to have a walk when you were a child?",
            "Where would you like to take a long walk if you had the chance?"
          ]
        },
        "1.2": {
          "type": "picture_description",
          "images": [
            "https://images.unsplash.com/photo-1519389950473-47ba0277781c?w=400&h=300&fit=crop",
            "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=400&h=300&fit=crop"
          ],
          "questions": [
            "Describe the technology and the people using it in the first picture.",
            "What kind of lifestyle or activity is shown in the second picture?",
            "Compare the two pictures and discuss whether technology helps or hinders people from being active."
          ]
        },
        "2": {
          "type": "discussion",
          "questions": [
            "What are the differences between the technology of the past and that of today?",
            "Does technological development have a negative impact on communication among people?",
            "Do you think technology unites or separates people?"
          ]
        },
        "3": {
          "type": "debate",
          "topic": "Technology brings people closer together",
          "for_points": [
            "Video calls and messaging apps allow people to maintain relationships across long distances.",
            "Social media platforms help people find communities with shared interests regardless of location.",
            "Technology enables collaboration between people in different countries, fostering global understanding."
          ],
          "against_points": [
            "People spend more time on screens than engaging in meaningful face-to-face conversations.",
            "Social media often creates superficial connections rather than deep, genuine relationships.",
            "Over-reliance on technology can lead to social isolation and reduced real-world social skills."
          ]
        }
      }
    },
    {
      "test_id": 7,
      "name": "Test 7",
      "parts": {
        "1.1": {
          "type": "interview",
          "questions": [
            "Do you have any hobbies?",
            "Do you have the same hobbies as your family members?",
            "Did you have any hobbies when you were a child?"
          ]
        },
        "1.2": {
          "type": "picture_description",
          "images": [
            "https://images.unsplash.com/photo-1460661419201-fd4cecdf8a8b?w=400&h=300&fit=crop",
            "https://images.unsplash.com/photo-1513364776144-60967b0f800f?w=400&h=300&fit=crop"
          ],
          "questions": [
            "Describe the artistic activity and the person involved in the first picture.",
            "What kind of creative work or art can you see in the second picture?",
            "Compare the two pictures and discuss which form of art you think is more important for education."
          ]
        },
        "2": {
          "type": "discussion",
          "questions": [
            "What is the right age for a child to learn drawing?",
            "Why do most children draw more often than adults do?",
            "Do you think galleries and museums should be free of charge?"
          ]
        },
        "3": {
          "type": "debate",
          "topic": "Art education should be mandatory in all schools",
          "for_points": [
            "Art education develops creativity and critical thinking skills that benefit students in all areas of life.",
            "Studying art helps children express emotions and improves their mental health and well-being.",
            "Art education preserves cultural heritage and teaches students to appreciate diverse forms of expression."
          ],
          "against_points": [
            "Schools have limited time and resources, which should be focused on core academic subjects.",
            "Not all students are interested in art, and forcing them to study it may reduce their motivation.",
            "Art can be pursued as an extracurricular activity, so making it mandatory is unnecessary."
          ]
        }
      }
    },
    {
      "test_id": 8,
      "name": "Test 8",
      "parts": {
        "1.1": {
          "type": "interview",
          "questions": [
            "How much time do you spend on these apps?",
            "What kind of apps do you have on your phone?",
            "What are the most and the least popular apps in your country?"
          ]
        },
        "1.2": {
          "type": "picture_description",
          "images": [
            "https://images.unsplash.com/photo-1488590528505-98d2b5aba04b?w=400&h=300&fit=crop",
            "https://images.unsplash.com/photo-1503676260728-1c00da094a0b?w=400&h=300&fit=crop"
          ],
          "questions": [
            "Describe the technology and how it is being used in the first picture.",
            "What kind of learning or education scene is shown in the second picture?",
            "Compare the two pictures and discuss whether digital learning is better than traditional classroom learning."
          ]
        },
        "2": {
          "type": "discussion",
          "questions": [
            "Do you think learning many subjects at one time is better or learning one subject is better?",
            "Do you think all teachers should have entertaining teaching styles?",
            "Is it important for people to learn new skills all life long?"
          ]
        },
        "3": {
          "type": "debate",
          "topic": "Children should be limited to 1 hour of app usage per day",
          "for_points": [
            "Excessive screen time has been linked to poor sleep, eye strain, and reduced physical activity in children.",
            "Limiting app usage encourages children to engage in outdoor play, reading, and creative activities.",
            "Time limits help prevent addiction to apps and social media, protecting children's mental health."
          ],
          "against_points": [
            "Many educational apps help children learn and develop new skills, so strict limits may hinder their progress.",
            "A rigid one-hour rule does not account for the different types of app usage, such as homework or creative projects.",
            "Parents should have the freedom to set their own guidelines based on their child's individual needs."
          ]
        }
      }
    },
    {
      "test_id": 9,
      "name": "Test 9",
      "parts": {
        "1.1": {
          "type": "interview",
          "questions": [
            "Do you like to get up early?",
            "What is your morning routine?",
            "What do you usually do in the morning?"
          ]
        },
        "1.2": {
          "type": "picture_description",
          "images": [
            "https://images.unsplash.com/photo-1571019613454-1cb2f99b2d8b?w=400&h=300&fit=crop",
            "https://images.unsplash.com/photo-1506784983877-45594efa4cbe?w=400&h=300&fit=crop"
          ],
          "questions": [
            "Describe the morning activity or routine shown in the first picture.",
            "What kind of planning or organization can you see in the second picture?",
            "Compare the two pictures and discuss whether having a strict morning routine leads to a more productive day."
          ]
        },
        "2": {
          "type": "discussion",
          "questions": [
            "Do you think children should plan their future careers?",
            "In general, do you think planning is important?",
            "Should children ask their teachers or parents for advice when making plans?"
          ]
        },
        "3": {
          "type": "debate",
          "topic": "Having a strict daily routine is essential for success",
          "for_points": [
            "A strict routine builds discipline and ensures that important tasks are completed consistently every day.",
            "Successful people such as athletes and business leaders often credit their daily routines for their achievements.",
            "Routines reduce decision fatigue, allowing people to focus their energy on meaningful and productive work."
          ],
          "against_points": [
            "Creativity and innovation often come from flexibility and spontaneity, not rigid schedules.",
            "A strict routine can lead to burnout and stress if there is no room for relaxation or unexpected events.",
            "Many successful people thrive with adaptable schedules that allow them to respond to new opportunities."
          ]
        }
      }
    }
  ]
}
